In [19]:
# numpy and basics. ===> np.select np.where
import pandas as pd
import numpy as np

In [2]:
# Series Object and the Dataframe

#  column/ list. and dataframe  one or more series

In [5]:
diction = {
    'name': 'Ade',
    'organisation': 'Saidatech',
    'location': 'turkey'
}
series = pd.Series(diction)
series

name                  Ade
organisation    Saidatech
location           turkey
dtype: object

In [11]:
list_items = list(diction.values())

# print(list_items)
list_series = pd.Series(list_items)
print(list_series)

0          Ade
1    Saidatech
2       turkey
dtype: object

In [14]:
list_index= [*diction] # diction.keys()
# print(list_index)
list_series1 = pd.Series(list_items, index=list_index)
print(list_series1)

name                  Ade
organisation    Saidatech
location           turkey
dtype: object

In [18]:
tup = tuple(list_items)
pd.Series(tup, list_index)

name                  Ade
organisation    Saidatech
location           turkey
dtype: object

In [22]:
arr = np.array(list_items, dtype= 'object')

num_series = pd.Series(arr, index= list_index)

In [25]:
# series?
series.index.

Index(['name', 'organisation', 'location'], dtype='object')

In [42]:
diction = {
    'name': 'Ade',
    'organisation': 'Saidatech',
    'location': 'turkey',
    'birth': 'turkey',
    'salary': None
}
series = pd.Series(diction)

# series = series.drop_duplicates(keep= 'last')
# series.drop_duplicates(keep= 'last', inplace=True)  

series

name                  Ade
organisation    Saidatech
location           turkey
birth              turkey
salary               None
dtype: object

In [37]:
series.isnull() # return bool values  1- true and 0- false
series.isna()

name            False
organisation    False
birth           False
salary           True
dtype: bool

In [39]:
#total number of missing values
series.isnull().sum()

1

In [43]:
series.count()
series.value_counts()

turkey       2
Ade          1
Saidatech    1
dtype: int64

In [48]:
age_numbers  = [22,43,44,55,33,22,33,45,55,33,44,43]
# pd.Series(age_numbers)
# grpup data based on age range or group

binz= [18,33,45,62]
label= ['teens','young adult', 'senoir citizens']


data = pd.cut(age_numbers, bins=binz, labels=label)

In [54]:
from pprint import pprint


pprint(data)
data.value_counts()

['teens', 'young adult', 'young adult', 'senoir citizens', 'teens', ..., 'young adult', 'senoir citizens', 'teens', 'young adult', 'young adult']
Length: 12
Categories (3, object): ['teens' < 'young adult' < 'senoir citizens']

teens              5
young adult        5
senoir citizens    2
dtype: int64

In [57]:
# take

fruit = {
    0: 'banana',
    1: 'orange',
    2: 'pineapple',
    }
fruit_ser = pd.Series(fruit)
fruit_ser

0       banana
1       orange
2    pineapple
dtype: object

In [108]:
fruit_code = pd.Series([1,2,3,0,1,2,1,2,1,2,1,1,1,0,0,0,0])
# map function



frt= fruit_code.map(fruit)
frt

0        orange
1     pineapple
2           NaN
3        banana
4        orange
5     pineapple
6        orange
7     pineapple
8        orange
9     pineapple
10       orange
11       orange
12       orange
13       banana
14       banana
15       banana
16       banana
dtype: object

In [76]:
# fruit_ser.take(fruit_code)
pprint(type(frt))

<class 'pandas.core.series.Series'>

In [107]:
#indexing 

#list indexing
# boolean indexing 
# fancy indexing


type(frt[::-1].reset_index().drop('index',axis='columns'))

sers= frt[::-1].reset_index().drop('index',axis='columns')[0]



sers[sers == 'banana']
sers[sers != 'banana']  #bool indexing use for filtering data sets

4        orange
5        orange
6        orange
7     pineapple
8        orange
9     pineapple
10       orange
11    pineapple
12       orange
14          NaN
15    pineapple
16       orange
Name: 0, dtype: object

In [87]:
series.map(lambda x:  1 if x == 'Ade' else 0)

name            1
organisation    0
location        0
birth           0
salary          0
dtype: int64

In [94]:
arr= np.array(series)

result = np.where(arr=='Ade',True, False)

print(result)

[ True False False False False]

In [96]:
series[result]

name    Ade
dtype: object

In [100]:
a= series =='Ade'  #True

In [103]:
series[a]

name    Ade
dtype: object

In [102]:
a

name             True
organisation    False
location        False
birth           False
salary          False
dtype: bool

In [122]:


fruit = {
    0: 'banana',
    1: 'orange',
    2: 'pineapple',
    }




def map_data(x):
    return fruit.get(x, x)
#     return fruit[x]



# fruit_code.apply(map_data)  # works on both series and dataframe
new_fruit= fruit_code.map(map_data)  #------> Series alone

In [120]:
fruit_code.dtype

dtype('int64')


## DataFRAME

In [128]:
# combined Series 

df= pd.DataFrame()
df['fruits']= new_fruit
df['fruit_code']= fruit_code
df.head(2)
df.tail(2)

    fruits  fruit_code
15  banana           0
16  banana           0

In [143]:
# dict_= pd.DataFrame(diction, index= range(len(diction)))
dict_ = pd.DataFrame(diction,index = diction.keys())

In [142]:
df = dict_[['name']]  # dataframe
dict_['name']  # series

name            Ade
organisation    Ade
location        Ade
birth           Ade
salary          Ade
Name: name, dtype: object

In [155]:
df= dict_.loc[['name']].T

In [157]:
df['person']= df

In [162]:
# df.drop('name', axis= 'columns')
df.drop('name', axis =1, inplace=True)

In [164]:
df.reset_index(inplace=True)

In [171]:
mapper= {
    'index': 'keys'
}

df.rename(columns = mapper,inplace=True)

In [174]:
len(df.columns)

2

In [185]:
# columns = [x.upper() for x in list(df.columns)]
item = []
for i in columns:
   item.append(i.upper()) 
    
# print(list(columns))

In [190]:
item = []
for i in columns:
   item.append(i.upper())

['KEYS', 'PERSON']

In [193]:
df.columns = item

In [198]:
df.set_index(df['KEYS'].values, inplace= True)

In [210]:
df.drop('KEYS', axis = 'columns', inplace=True)

In [211]:
df

                 PERSON
name                Ade
organisation  Saidatech
location         turkey
birth            turkey
salary             None

In [212]:
df['points']= [1,2,4,2,4]

In [215]:
df['points']= df['points'] * 20

In [219]:
total = df['points'].sum()

In [221]:
df['cumulative'] =df['points'].cumsum()

In [222]:
df

                 PERSON  points  cumulative
name                Ade      20          20
organisation  Saidatech      40          60
location         turkey      80         140
birth            turkey      40         180
salary             None      80         260

In [238]:
import os


file = os.getcwd()
directory = os.path.dirname(file)

for i in os.listdir(directory):
    if i  == 'Resources':
        path = os.path.join(directory, 'resources')
        break
        
data_path= os.path.join(path, 'data')  #/Users/de_tai/Desktop/python_main/resources/data

file_name = [os.path.join(path, x) for x in os.listdir(data_path)]
print(file_name)

['/Users/de_tai/Desktop/python_main/resources/dowstocks.csv', '/Users/de_tai/Desktop/python_main/resources/missing.csv', '/Users/de_tai/Desktop/python_main/resources/portfoliodate.csv', '/Users/de_tai/Desktop/python_main/resources/portfolio.csv', '/Users/de_tai/Desktop/python_main/resources/prices.csv', '/Users/de_tai/Desktop/python_main/resources/portfolioblank.csv', '/Users/de_tai/Desktop/python_main/resources/portfolio2.csv']

In [239]:
clip = pd.read_clipboard()

In [240]:
clip

    Name  Score
0    Sam     30
1    Ade     20
2  Moses     40

In [241]:
pd.read_csv(file_name[0])

FileNotFoundError: [Errno 2] No such file or directory: '/Users/de_tai/Desktop/python_main/resources/dowstocks.csv'

In [244]:
os.path.exists('Users/de_tai/Desktop/python_main/resources/dowstocks.csv')

False

In [246]:
file= 'resources/data/missing.csv'

def file_reader(path):
    return pd.read_csv(path)

In [250]:
data1 = file_reader(file)

In [251]:
data1

   name  shares  price
0    AA   100.0  32.20
1   IBM    50.0  91.10
2   CAT   150.0  83.44
3  MSFT     NaN  51.23
4    GE    95.0  40.37
5  MSFT    50.0  65.10
6   IBM     NaN  70.44

In [252]:
data1.dtypes

name       object
shares    float64
price     float64
dtype: object

In [254]:
data1.describe()

           shares      price
count    5.000000   7.000000
mean    89.000000  61.982857
std     41.593269  21.829700
min     50.000000  32.200000
25%     50.000000  45.800000
50%     95.000000  65.100000
75%    100.000000  76.940000
max    150.000000  91.100000

In [256]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   shares  5 non-null      float64
 2   price   7 non-null      float64
dtypes: float64(2), object(1)
memory usage: 296.0+ bytes

In [262]:
data1[data1['shares'].isnull()]

   name  shares  price
3  MSFT     NaN  51.23
6   IBM     NaN  70.44

In [270]:
# we decide tp drop or delete null values
# we assume the figures
    # mean value 
    # back fill
    # front fill 
    #     linear regression
    

a = data1.copy()

# a.dropna(axis= 'rows')
a.dropna(how= 'any', inplace=True)
a

In [272]:
sample = data1.copy()

In [277]:
# mean
mean = sample['shares'].mean()

In [278]:
sample.fillna(mean)

   name  shares  price
0    AA   100.0  32.20
1   IBM    50.0  91.10
2   CAT   150.0  83.44
3  MSFT    89.0  51.23
4    GE    95.0  40.37
5  MSFT    50.0  65.10
6   IBM    89.0  70.44

In [279]:
sample2 = data1.copy()

sample2

   name  shares  price
0    AA   100.0  32.20
1   IBM    50.0  91.10
2   CAT   150.0  83.44
3  MSFT     NaN  51.23
4    GE    95.0  40.37
5  MSFT    50.0  65.10
6   IBM     NaN  70.44

In [286]:
sample2.fillna(method = 'bfill')
sample2

   name  shares  price
0    AA   100.0  32.20
1   IBM    50.0  91.10
2   CAT   150.0  83.44
3  MSFT     NaN  51.23
4    GE    95.0  40.37
5  MSFT    50.0  65.10
6   IBM     NaN  70.44

In [287]:
from collections import OrderedDict

d = OrdereddDict()
d.update(diction)

In [288]:
d.update({'l
          owkey':'another key'})

In [299]:
item = dict(map(lambda x: (x,d[x]),[*d][:4]))

In [300]:
def main():
    vowels = 0
    consonants = 0
    mystr = input("Enter your String:")
    mystr = mystr.lower().strip()


    for vw in mystr:
        if vw in ('a','e','i','o','u'):
            vowels += 1
    print ('This string consists of ', vowels , 'vowels.')


    for cs in mystr:
         if cs in ('q', 'w', 'r', 't', 'y', 'p', 's', 'd', 'f', 'g', 'h', 'j',\
         'k', 'l', 'z', 'c', 'v', 'b', 'n', 'm'):
             consonants += 1
    print ('This string consists of ' , consonants , 'consonants.')

main()

{'name': 'Ade',
 'organisation': 'Saidatech',
 'location': 'turkey',
 'birth': 'turkey'}

In [316]:
d.items()

odict_items([('name', 'Ade'), ('organisation', 'Saidatech'), ('location', 'turkey'), ('birth', 'turkey'), ('salary', None), ('lowkey', 'another key')])

In [323]:
sample2['new']= sample2['price'].shift(periods=1, fill_value=0
                                      )

In [324]:
sample2

   name  shares  price    new
0    AA   100.0  32.20   0.00
1   IBM    50.0  91.10  32.20
2   CAT   150.0  83.44  91.10
3  MSFT     NaN  51.23  83.44
4    GE    95.0  40.37  51.23
5  MSFT    50.0  65.10  40.37
6   IBM     NaN  70.44  65.10

In [330]:
def add(x):
    if x['Order']=='MTP':
        return x['price']+ x['new']
    else:
        return None

In [331]:
sample2.apply(add,axis=1)

0       NaN
1    123.30
2       NaN
3       NaN
4       NaN
5       NaN
6    135.54
dtype: float64

In [360]:
my_dict = {'0123': 'apple',
           '2314': 'banana',
           '5214': 'cherry'}
my_list = [['0021', '0123', 10],
           ['0025', '0123', 12],
           ['0032', '2314', 8],
           ['0045', '0123', 13],
           ['0060', '5214', 12], 
           ['0067', '2314', 10],]



new_list = map(lambda x: list((x[0],my_dict.get(x[1]),x[2])),my_list)

In [361]:
for i in new_list:
    print(i)

['0021', 'apple', 10]
['0025', 'apple', 12]
['0032', 'banana', 8]
['0045', 'apple', 13]
['0060', 'cherry', 12]
['0067', 'banana', 10]

In [369]:
!head -n 3 /Users/de_tai/Desktop/python_main/day15/Resources/data/dowstocks.csv

name,price,date,time,change,open,high,low,volume
"AA",39.48,"6/11/2007","9:36am",-0.18,39.67,39.69,39.45,181800
"AIG",71.38,"6/11/2007","9:36am",-0.15,71.29,71.60,71.15,195500

In [373]:
!touch sample.py

In [376]:
!mkdir okay

mkdir: okay: File exists

In [388]:
!mkdir okay; cd okay ; touch yes.txt ; cat ../day15.ipynb > sample.ipynb!

mkdir: okay: File exists

In [1]:
!ls

sample.ipynb yes.txt